Revit 2024 API
DocumentWorksharingEnabledEventArgs.GetDocument Method
 Returns document associated with this event
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public Document GetDocument()
Visual Basic
Public Function GetDocument As Document
Visual C++
public:
Document^ GetDocument()
Return Value
 The document associated with this event.
See Also
DocumentWorksharingEnabledEventArgs Class
Autodesk.Revit.DB.Events Namespace